zdavatz/fp-sns-stbox1/Middlewares/ST/STM32WB07_06/includes/stm32wb07_06_hal_aci.h
  * @retval Value indicating success or error code.
  */
ble_status_t aci_hal_transmitter_test_packets(uint8_t tx_frequency,
                                              uint8_t length_of_test_data,
                                              uint8_t packet_payload,
                                              uint16_t number_of_packets,
                                              uint8_t phy);
/**
  * @brief This command is equivalent to the corresponding Bluetooth Low Energy
  *        standard command HCI_LE_TRANSMITTER_TEST_V3, with an additional
  *        parameter to specify the number of packets to be transmitted. An
  *        HCI_COMMAND_STATUS_EVENT is sent after the command is received. An
  *        ACI_HAL_LE_TEST_END_EVENT is generated when the number of specified
  *        packets have been sent.
  * @param tx_channel N = (F - 2402) / 2. Frequency Range : 2402 MHz to 2480 MHz
  *        Values:
  *        - 0x00 ... 0x27
  * @param test_data_length Length in bytes of payload data in each packet.
  * @param packet_payload Content of the Payload of the test reference packets.
  *        0: PRBS9 sequence '11111111100000111101...' (in transmission order) 1:
  *        Repeated '11110000' (in transmission order) sequence 2: Repeated
  *        '10101010' (in transmission order) sequence 3: PRBS15 sequence 4:
  *        Repeated '11111111' (in transmission order) sequence 5: Repeated
  *        '00000000' (in transmission order) sequence 6: Repeated '00001111' (in
  *        transmission order) sequence 7: Repeated '01010101' (in transmission
  *        order) sequence
  *        Values:
  *        - 0x00: PRBS9
  *        - 0x01: Repeated '11110000'
  *        - 0x02: Repeated '10101010'
  *        - 0x03: PRBS15
  *        - 0x04: Repeated '11111111'
  *        - 0x05: Repeated '00000000'
  *        - 0x06: Repeated '00001111'
  *        - 0x07: Repeated '01010101'
  * @param number_of_packets Number of packets to be sent.
  * @param phy PHY to be used by the transmitter.
  *        Values:
  *        - 0x01: LE_1M_PHY
  *        - 0x02: LE_2M_PHY
  *        - 0x03: LE_CODED_PHY_S8
  *        - 0x04: LE_CODED_PHY_S2
  * @param cte_length Expected length of the Constant Tone Extension in 8
  *        microseconds units. If 0, no Constant Tone Extension expected.
  *        Values:
  *        - 0x00
  *        - 0x02 ... 0x14
  * @param cte_type Type of the Constant Tone Extension in the test reference
  *        packets. 0: AoA; 1: AoD with 1 us slots; 2: AoD with 2 us slots.
  *        Values:
  *        - 0x00: CTE_AOA
  *        - 0x01: CTE_AOD_1us
  *        - 0x02: CTE_AOD_2us
  * @param switching_pattern_length The number of Antenna IDs in the pattern.
  *        Values:
  *        - 0x02 ... 0x4B
  * @param antenna_ids List of Antenna IDs in the pattern.
  * @retval Value indicating success or error code.
  */
ble_status_t aci_hal_transmitter_test_packets_v2(uint8_t tx_channel,
                                                 uint8_t test_data_length,
                                                 uint8_t packet_payload,
                                                 uint16_t number_of_packets,
                                                 uint8_t phy,
                                                 uint8_t cte_length,
                                                 uint8_t cte_type,
                                                 uint8_t switching_pattern_length,
                                                 uint8_t antenna_ids[]);
/**
  * @brief
  * @param ble_state
  * @param connection_handle Connection handle that identifies the connection.
  *        Values:
  *        - 0x0000 ... 0x0EFF
  * @param priority_max
  * @param priority_min
  * @retval Value indicating success or error code.
  */
ble_status_t aci_hal_set_priority(uint8_t ble_state,
                                  uint16_t connection_handle,
                                  uint8_t priority_max,
                                  uint8_t priority_min);
/**
  * @brief
  * @param ce_length
  * @retval Value indicating success or error code.
  */
ble_status_t aci_hal_set_ce_length(uint16_t ce_length);
/**
  * @brief
  * @param start_address
  * @param num_bytes Length of Data in octets
  * @param data
  * @retval Value indicating success or error code.
  */
ble_status_t aci_hal_write_radio_reg(uint32_t start_address,
                                     uint8_t num_bytes,
                                     uint8_t data[]);
/**
  * @brief
  * @param start_address
  * @param num_bytes
  * @param[out] data_length Length of Data in octets
  * @param[out] data
  * @retval Value indicating success or error code.
  */
ble_status_t aci_hal_read_radio_reg(uint32_t start_address,
                                    uint8_t num_bytes,
                                    uint8_t *data_length,
                                    uint8_t data[]);
/**
  * @brief This command is used to enable ANTENNA_ID signal by enabling the
  *        Alternate Function on the corresponding pins. Some IOs may not be
  *        enabled, depending on resources availability (e.g. IOs used for
  *        communication).
  * @param antenna_ids ANTENNA_ID pins to be enabled. Each bit in the mask
  *        enables the corresponding bit of the ANTENNA_ID signal, which is
  *        output on PB[0:7].
  *        Flags:
  *        - 0x01: ANTENNA_ID_0
  *        - 0x02: ANTENNA_ID_1
  *        - 0x04: ANTENNA_ID_2
  *        - 0x08: ANTENNA_ID_3
  *        - 0x10: ANTENNA_ID_4
  *        - 0x20: ANTENNA_ID_5
  *        - 0x40: ANTENNA_ID_6
  * @param antenna_id_shift This parameter can be set to a value different from
  *        zero to shift the ANTENNA_ID signal by the given number of bits. This
  *        number does not affect the pin selected by antenna_ids parameter. E.g.
  *        to have the ANTENNA_ID signal output on PB[2:4], set antenna_ids to
  *        enable ANTENNA_ID[2:4] (antenna_ids = 0x1C) and antenna_id_shift to 2.
  *        Values:
  *        - 0 ... 6
  * @param default_antenna_id The ID of antenna that the controller will select
  *        for regular communication. The antenna to be used when sending or
  *        receiving the CTE field needs to be specified through the antenna_ids
  *        parameter of the dedicated HCI commands (i.e.
  *        hci_le_set_connectionless_cte_transmit_parameters,
  *        hci_le_set_connectionless_iq_sampling_enable,
  *        hci_le_set_connection_cte_receive_parameters and
  *        hci_le_set_connection_cte_transmit_parameters).
  *        Values:
  *        - 0x00 ... 0x7F
  * @param rf_activity_enable Enable or disable the RF Activity signal, if
  *        supported by the device. This signal can be used to enable the antenna
  *        switch only when necessary.
  *        Values:
  *        - 0x00: DISABLED
  *        - 0x01: ENABLED
  * @retval Value indicating success or error code.
  */
ble_status_t aci_hal_set_antenna_switch_parameters(uint8_t antenna_ids,
                                                   uint8_t antenna_id_shift,
                                                   uint8_t default_antenna_id,
                                                   uint8_t rf_activity_enable);
/**
  * @brief This command can be used to get the maximum used size of the stack's
  *        internal FIFO queues: isr1_fifo, isr2_fifo and user_fifo. These values
  *        can be used to chose the maximum correct size for the queues, which
  *        can be set through the BLE_STACK_Init() function. If one of these
  *        queues reaches the maximum size, an hci_hardware_error_event is
  *        raised, with error code 0x03.
  * @param[out] isr0_fifo_max_level Maximum size reached by the FIFO used for
  *             critical controller events produced by the ISR (e.g. rx data
  *             packets). See isr0_fifo_size parameter field of
  *             BLE_STACK_InitTypeDef structure, used by BLE_STACK_Init().
  * @param[out] isr1_fifo_max_level Maximum size reached by the FIFO used for
  *             non-critical controller events produced by the ISR (e.g.
  *             advertising or IQ sampling reports). See isr1_fifo_size parameter
  *             field of BLE_STACK_InitTypeDef structure, used by
  *             BLE_STACK_Init().
  * @param[out] user_fifo_max_level Maximum size reached by the FIFO used for
  *             controller and host events produced outside the ISR. See
  *             user_fifo_size parameter field of BLE_STACK_InitTypeDef
  *             structure, used by BLE_STACK_Init().
  * @retval Value indicating success or error code.
  */
ble_status_t aci_hal_get_evt_fifo_max_level(uint16_t *isr0_fifo_max_level,
                                            uint16_t *isr1_fifo_max_level,
                                            uint16_t *user_fifo_max_level);
/**
  * @brief
  * @param connection_handle Connection handle to notify.
  * @param service_handle Handle of service to which the characteristic belongs
  *        Values:
  *        - 0x0001 ... 0xFFFF
  * @param char_handle Handle of the characteristic
  *        Values:
  *        - 0x0001 ... 0xFFFF
  * @param value_length Length of the characteristic to be notified. Only ATT_MTU
  *        - 3 bytes are sent with notifications.
  * @retval Value indicating success or error code.
  */
ble_status_t aci_test_tx_notification_start(uint16_t connection_handle,
                                            uint16_t service_handle,
                                            uint16_t char_handle,
                                            uint16_t value_length);
/**
  * @brief
  * @param connection_handle Connection handle that identifies the connection.
  *        Values:
  *        - 0x0000 ... 0x0EFF
  * @param attr_handle Handle of the attribute to be written
  *        Values:
  *        - 0x0001 ... 0xFFFF
  * @param value_length Length of the characteristic to be written with write
  *        commands. Only ATT_MTU - 3 bytes are written.
  * @retval Value indicating success or error code.
  */
ble_status_t aci_test_tx_write_command_start(uint16_t connection_handle,
                                             uint16_t attr_handle,
                                             uint16_t value_length);
/**
  * @brief
  * @param connection_handle Connection handle that identifies the connection.
  *        Values:
  *        - 0x0000 ... 0x0EFF
  * @param attr_handle Handle of the attribute to be written
  *        Values:
  *        - 0x0001 ... 0xFFFF
  * @param notifications_write_cmds
  *        Values:
  *        - 0x00: Notifications
  *        - 0x01: Write Commands
  * @retval Value indicating success or error code.
  */
ble_status_t aci_test_rx_start(uint16_t connection_handle,
                               uint16_t attr_handle,
                               uint8_t notifications_write_cmds);
/**
  * @brief
  * @param tx_rx
  *        Values:
  *        - 0x00: TX
  *        - 0x01: RX
  * @retval Value indicating success or error code.
  */
ble_status_t aci_test_stop(uint8_t tx_rx);
/**
  * @brief
  * @param[out] tx_packets
  * @param[out] rx_packets
  * @param[out] rx_data_length
  * @param[out] rx_sequence_errors
  * @retval Value indicating success or error code.
  */
ble_status_t aci_test_report(uint32_t *tx_packets,
                             uint32_t *rx_packets,
                             uint16_t *rx_data_length,
                             uint32_t *rx_sequence_errors);
/**
     * @}
     */

#ifdef __cplusplus
}
#endif

#endif /* _STM32WB07_06_HAL_ACI_H_ */
